// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//  кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
//
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
friends.length >= 3 ? console.log("Це великий масив, в якому 3 і більше елементи.") : console.log("Це маленький масив, в якому менше 3-х елементів.");


//   - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
//
let var1 = 20;
let var2 = 3;
let var3 = 1;
let var_mid = var1 + var2 + var3 - Math.max(var1, var2, var3) - Math.min(var1, var2, var3);
console.log("є середнім (більше одного, але менше за інше): " + var_mid);
let first_is_mid = var1 === var_mid;
console.log("перше число між двома іншими: " + first_is_mid);

// plan B
let vars = [20, 3, 1];
let var_mid_ = [...vars].sort(function (a, b) {
    return a - b;
})[1];
console.log("є середнім (більше одного, але менше за інше): " + var_mid_);
let first_is_mid_ = vars[0] === var_mid_;
console.log("перше число між двома іншими: " + first_is_mid_);


//   - Перепишіть конструкцію if з використанням умовного оператора '?':
//  let result;
//  if (a + b < 4) {
//     result = 'Мало';
//  } else {
//     result = 'Багато';
//  }
//
let a = 1;
let b = 3;
let result = a + b < 4 ? 'Мало' : 'Багато';
console.log(result);


//  - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//
let some_var = 10;
let some_var_type = some_var > 0 ? "позитивним" : some_var < 0 ? "негативним" : "нулем";
console.log(`яким є число ${some_var}? ${some_var_type}`);