//  - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
//
let time = +prompt("Введите число от 0 до 59");
if (time < 16) {
    console.log("Четверть 1");
} else if (time < 31) {
    console.log("Четверть 2");
} else if (time < 46) {
    console.log("Четверть 3");
} else {
    console.log("Четверть 4");
}


//  - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//
let day = +prompt("Введите число от 1 до 31");
if (day < 11) {
    console.log("Декада 1");
} else if (day < 21) {
    console.log("Декада 2");
} else {
    console.log("Декада 3");
}


// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//
let test = true;
if (test === true) {
    console.log("Вірно");
} else {
    console.log("Неправильно");
}
test === true ? console.log("Вірно") : console.log("Неправильно");


// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//
let a = +prompt("Введите значение 1, 0 или -3");
if (a !== 0) {
    console.log("Вірно");
} else if (a === 1 || a === -3) {
    console.log("Невірно");
}


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
//
let day = +prompt("Введите номер дня недели");
switch (day) {
    case 1:
        console.log("Понедельник - отдыхаем после выходных");
        break;
    case 2:
        console.log("Вторник - готовимся к работе");
        break;
    case 3:
        console.log("Среда - работаем");
        break;
    case 4:
        console.log("Четверг - отдыхаем после работы");
        break;
    case 5:
        console.log("Пятница - готовимся к выходным");
        break;
    case 6:
        console.log("Суббота - отдыхаем");
        break;
    case 7:
        console.log("Воскресенье - отдыхаем");
        break;
    default:
        console.log("Неверные данные!");
}


// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
//
let year = +prompt("Введите год");
year % 4 === 0 ? console.log("Это високосный год") : console.log("Это не високосный год");


// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//
let answer = prompt("Яка «офіційна» назва JavaScript?");
if (answer === "ECMAScript") {
    console.log("Правильно!");
} else {
    console.log("Не знаєте? ECMAScript!");
}